Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.http.icanhazip: Reading...
data.http.icanhazip: Read complete after 0s [id=http://icanhazip.com]
data.aws_route53_zone.xrd: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0fc5d935ebf8bc3bc]
data.aws_route53_zone.xrd: Read complete after 0s [id=Z0097651QXBS8RQC1ZQ5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.atlantis will be created
+ resource "aws_instance" "atlantis" {
      + ami                                  = "ami-0fc5d935ebf8bc3bc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "id_rsa.modus.pub"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-063668f4d9e4b16ce"
      + tags                                 = {
          + "Name" = "AtlantisServer"
        }
      + tags_all                             = {
          + "Name"      = "AtlantisServer"
          + "terraform" = "/home/ubuntu/code/atlantis/terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_route53_record.xrd will be created
+ resource "aws_route53_record" "xrd" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "atlantis.xrd.com.br"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0097651QXBS8RQC1ZQ5"
    }

  # aws_security_group.atlantis will be created
+ resource "aws_security_group" "atlantis" {
      + arn                    = (known after apply)
      + description            = "I can do 22 and the world 4141"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.30.252.0/22",
                  + "185.199.108.0/22",
                  + "140.82.112.0/20",
                  + "143.55.64.0/20",
                ]
              + description      = "Atlants - GitHub IPs"
              + from_port        = 4141
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 4141
            },
          + {
              + cidr_blocks      = [
                  + "44.204.144.237/32",
                ]
              + description      = "OnlyMyIP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "atlants"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "terraform" = "/home/ubuntu/code/atlantis/terraform"
        }
      + vpc_id                 = "vpc-0d77922908f66b2de"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ec2_start = (known after apply)
+ ec2_stop  = (known after apply)
+ ssh       = "   ssh ubuntu@atlantis.xrd.com.br   "
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.xrd.com.br:4141/lock?id=marcosdiez%252Fatlantis_test%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`